In [ ]:
# https://dataitgirls2.github.io/10minutes2pandas/

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.694474 -0.755857 -0.666192 -2.215591
2013-01-02 -1.955882  0.078742  0.221333  0.966885
2013-01-03 -1.264912  0.641606  0.921175 -2.216988
2013-01-04  0.208825 -0.635142 -0.292897 -1.481527
2013-01-05  0.496277  1.127832  0.512147  1.942056
2013-01-06  1.746691  1.081012  0.823604  1.839070

In [5]:
df2 = pd.DataFrame({'A' :1.,
                   'B' : pd.Timestamp('20130102'),
                   'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D' : np.array([3]*4,dtype='int32'),
                    'E' : pd.Categorical(['test','train','test','train']),
                   'F' : 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [14]:
# df2.<TAB>
df

                   A         B         C         D
2013-01-01 -0.040135 -1.061671  0.335968  0.093195
2013-01-02 -0.102492  0.774595 -1.536315  0.590857
2013-01-03 -0.413065 -0.535663 -1.001198 -0.641993
2013-01-04  0.912804  2.017046 -1.072437 -1.058808
2013-01-05  1.468099  0.885285 -0.023822 -1.946981
2013-01-06 -1.750614  1.235052  0.785758 -0.568032

In [15]:
df.index # 행이름

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
 df.columns # 열이름

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.values # 값들

array([[-0.04013493, -1.06167067,  0.33596763,  0.09319466],
       [-0.10249238,  0.77459532, -1.53631477,  0.59085714],
       [-0.41306463, -0.53566319, -1.00119823, -0.64199311],
       [ 0.91280396,  2.01704647, -1.07243746, -1.05880844],
       [ 1.46809863,  0.88528514, -0.02382215, -1.94698082],
       [-1.75061352,  1.23505186,  0.7857577 , -0.56803226]])

In [19]:
df.describe() # 데이터의 대략적인 통계정보

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.012433  0.552441 -0.418675 -0.588627
std    1.116690  1.145469  0.915632  0.886062
min   -1.750614 -1.061671 -1.536315 -1.946981
25%   -0.335422 -0.208099 -1.054628 -0.954605
50%   -0.071314  0.829940 -0.512510 -0.605013
75%    0.674569  1.147610  0.246020 -0.072112
max    1.468099  2.017046  0.785758  0.590857

In [20]:
df.T # 데이터 전치 행,열전환

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.040135   -0.102492   -0.413065    0.912804    1.468099   -1.750614
B   -1.061671    0.774595   -0.535663    2.017046    0.885285    1.235052
C    0.335968   -1.536315   -1.001198   -1.072437   -0.023822    0.785758
D    0.093195    0.590857   -0.641993   -1.058808   -1.946981   -0.568032

In [21]:
df.sort_index(axis=1, ascending=False) # 열별 내림차순

                   D         C         B         A
2013-01-01  0.093195  0.335968 -1.061671 -0.040135
2013-01-02  0.590857 -1.536315  0.774595 -0.102492
2013-01-03 -0.641993 -1.001198 -0.535663 -0.413065
2013-01-04 -1.058808 -1.072437  2.017046  0.912804
2013-01-05 -1.946981 -0.023822  0.885285  1.468099
2013-01-06 -0.568032  0.785758  1.235052 -1.750614

In [23]:
df.sort_values(by='B') # B에있는 밸류값으로 정력 오름차순

                   A         B         C         D
2013-01-01 -0.040135 -1.061671  0.335968  0.093195
2013-01-03 -0.413065 -0.535663 -1.001198 -0.641993
2013-01-02 -0.102492  0.774595 -1.536315  0.590857
2013-01-05  1.468099  0.885285 -0.023822 -1.946981
2013-01-06 -1.750614  1.235052  0.785758 -0.568032
2013-01-04  0.912804  2.017046 -1.072437 -1.058808

In [6]:
df['A']

2013-01-01    1.694474
2013-01-02   -1.955882
2013-01-03   -1.264912
2013-01-04    0.208825
2013-01-05    0.496277
2013-01-06    1.746691
Freq: D, Name: A, dtype: float64

In [7]:
df[0:3]

                   A         B         C         D
2013-01-01  1.694474 -0.755857 -0.666192 -2.215591
2013-01-02 -1.955882  0.078742  0.221333  0.966885
2013-01-03 -1.264912  0.641606  0.921175 -2.216988

In [8]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.955882  0.078742  0.221333  0.966885
2013-01-03 -1.264912  0.641606  0.921175 -2.216988
2013-01-04  0.208825 -0.635142 -0.292897 -1.481527

In [9]:
df.loc[dates[0]]

A    1.694474
B   -0.755857
C   -0.666192
D   -2.215591
Name: 2013-01-01 00:00:00, dtype: float64

In [10]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.694474 -0.755857
2013-01-02 -1.955882  0.078742
2013-01-03 -1.264912  0.641606
2013-01-04  0.208825 -0.635142
2013-01-05  0.496277  1.127832
2013-01-06  1.746691  1.081012

In [11]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.955882  0.078742
2013-01-03 -1.264912  0.641606
2013-01-04  0.208825 -0.635142

In [28]:
df.loc[dates[2],['A','B','C']]

A   -1.264912
B    0.641606
C    0.921175
Name: 2013-01-03 00:00:00, dtype: float64

In [48]:
df.iloc[:,3]

2013-01-01   -2.215591
2013-01-02    0.966885
2013-01-03   -2.216988
2013-01-04   -1.481527
2013-01-05    1.942056
2013-01-06    1.839070
Freq: D, Name: D, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.208825 -0.635142
2013-01-05  0.496277  1.127832

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.955882  0.221333
2013-01-03 -1.264912  0.921175
2013-01-05  0.496277  0.512147

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.955882  0.078742  0.221333  0.966885
2013-01-03 -1.264912  0.641606  0.921175 -2.216988

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.755857 -0.666192
2013-01-02  0.078742  0.221333
2013-01-03  0.641606  0.921175
2013-01-04 -0.635142 -0.292897
2013-01-05  1.127832  0.512147
2013-01-06  1.081012  0.823604

In [40]:
type(df.iloc[1,1]) # 동일

numpy.float64

In [41]:
type(df.iat[1,2]) # 동일

numpy.float64

In [42]:
df[df.A>0]

                   A         B         C         D
2013-01-01  1.694474 -0.755857 -0.666192 -2.215591
2013-01-04  0.208825 -0.635142 -0.292897 -1.481527
2013-01-05  0.496277  1.127832  0.512147  1.942056
2013-01-06  1.746691  1.081012  0.823604  1.839070

In [43]:
df[df>0]

                   A         B         C         D
2013-01-01  1.694474       NaN       NaN       NaN
2013-01-02       NaN  0.078742  0.221333  0.966885
2013-01-03       NaN  0.641606  0.921175       NaN
2013-01-04  0.208825       NaN       NaN       NaN
2013-01-05  0.496277  1.127832  0.512147  1.942056
2013-01-06  1.746691  1.081012  0.823604  1.839070

In [44]:
df2 = df.copy()
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  1.694474 -0.755857 -0.666192 -2.215591    one
2013-01-02 -1.955882  0.078742  0.221333  0.966885    one
2013-01-03 -1.264912  0.641606  0.921175 -2.216988    two
2013-01-04  0.208825 -0.635142 -0.292897 -1.481527  three
2013-01-05  0.496277  1.127832  0.512147  1.942056   four
2013-01-06  1.746691  1.081012  0.823604  1.839070  three

In [47]:
df2[df2['E'].isin(['two','four'])] # 필터링함수

                   A         B         C         D     E
2013-01-03 -1.264912  0.641606  0.921175 -2.216988   two
2013-01-05  0.496277  1.127832  0.512147  1.942056  four

In [50]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [52]:
df['F'] = s1

In [54]:
df.at[dates[0],'A'] = 0 # 라벨에 의해 값설정

In [58]:
df.iat[0,1] = 0 # 위치에 의해 값설정

In [62]:
df.loc[:,'D'] = np.array([5] * len(df)) # df의 길이만큼 D열을 5로바꿔라

In [63]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.666192  5  NaN
2013-01-02 -1.955882  0.000000  0.221333  5  1.0
2013-01-03 -1.264912  0.641606  0.921175  5  2.0
2013-01-04  0.208825 -0.635142 -0.292897  5  3.0
2013-01-05  0.496277  1.127832  0.512147  5  4.0
2013-01-06  1.746691  1.081012  0.823604  5  5.0

In [65]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.666192 -5  NaN
2013-01-02 -1.955882  0.000000 -0.221333 -5 -1.0
2013-01-03 -1.264912 -0.641606 -0.921175 -5 -2.0
2013-01-04 -0.208825 -0.635142 -0.292897 -5 -3.0
2013-01-05 -0.496277 -1.127832 -0.512147 -5 -4.0
2013-01-06 -1.746691 -1.081012 -0.823604 -5 -5.0

In [67]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0] : dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.666192  5  NaN  1.0
2013-01-02 -1.955882  0.000000  0.221333  5  1.0  1.0
2013-01-03 -1.264912  0.641606  0.921175  5  2.0  NaN
2013-01-04  0.208825 -0.635142 -0.292897  5  3.0  NaN

In [68]:
df1.dropna(how='any')

                   A    B         C  D    F    E
2013-01-02 -1.955882  0.0  0.221333  5  1.0  1.0

In [71]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.666192  5  5.0  1.0
2013-01-02 -1.955882  0.000000  0.221333  5  1.0  1.0
2013-01-03 -1.264912  0.641606  0.921175  5  2.0  5.0
2013-01-04  0.208825 -0.635142 -0.292897  5  3.0  5.0

In [72]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [ ]:
 # https://dataitgirls2.github.io/10minutes2pandas/
# 5. Operation (연산)